## Plan Result (prod_global)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sandbox-build&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                 = "hmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      ~ frontend_endpoint {
          ~ host_name                    = "www.fees-register.platform.hmcts.net" -> "sandbox-build.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwfees-register"
          ~ name                         = "wwwfees-register" -> "sandbox-build"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.paybubble.platform.hmcts.net" -> "www.fees-register.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwpaybubble"
          ~ name                         = "wwwpaybubble" -> "wwwfees-register"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.manage-payments.platform.hmcts.net" -> "www.paybubble.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwmanage-payments"
          ~ name                         = "wwwmanage-payments" -> "wwwpaybubble"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.paymentoutcome-web.platform.hmcts.net" -> "www.manage-payments.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwpayment-outcome"
          ~ name                         = "wwwpayment-outcome" -> "wwwmanage-payments"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.platform.hmcts.net"
          + name                         = "wwwpayment-outcome"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sandbox-build",
            ]
          + name               = "sandbox-buildredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "sandbox-build.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (258 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["sandbox-build"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/sandbox-build"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1660,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->